#### Terraform Format and Style: ``
#### Terraform Initialization: `success`
#### Terraform Validation: `success`
#### Terraform Plan: `success`
<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.asg.aws_autoscaling_group.this will be created
  + resource "aws_autoscaling_group" "this" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 2
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = "EC2"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 4
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = "test-asg"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = [
          + "subnet-004c314f965ff4a14",
          + "subnet-0ff7ef2b7250432d7",
        ]
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + availability_zone_distribution (known after apply)

      + instance_refresh {
          + strategy = "Rolling"

          + preferences {
              + max_healthy_percentage       = 100
              + min_healthy_percentage       = 50
              + scale_in_protected_instances = "Ignore"
              + skip_matching                = false
              + standby_instances            = "Ignore"
            }
        }

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + mixed_instances_policy (known after apply)

      + tag {
          + key                 = "Environment"
          + propagate_at_launch = true
          + value               = "dev"
        }
      + tag {
          + key                 = "Managed_by"
          + propagate_at_launch = true
          + value               = "terraform"
        }
      + tag {
          + key                 = "Project"
          + propagate_at_launch = true
          + value               = "dev-project"
        }

      + traffic_source (known after apply)
    }

  # module.launch_template.aws_launch_template.this will be created
  + resource "aws_launch_template" "this" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + description     = "Launch template for development environment"
      + id              = (known after apply)
      + image_id        = "ami-0f58b397bc5c1f2e8"
      + instance_type   = "t2.micro"
      + key_name        = "aes"
      + latest_version  = (known after apply)
      + name            = "dev-app-template"
      + name_prefix     = (known after apply)
      + tags            = {
          + "Environment" = "dev"
          + "Managed_by"  = "terraform"
          + "Name"        = "dev-app-template"
          + "Project"     = "dev-project"
        }
      + tags_all        = {
          + "Environment" = "dev"
          + "Managed_by"  = "terraform"
          + "Name"        = "dev-app-template"
          + "Project"     = "dev-project"
        }
        # (1 unchanged attribute hidden)

      + metadata_options (known after apply)

      + monitoring {
          + enabled = true
        }

      + network_interfaces {
          + associate_public_ip_address = "true"
          + security_groups             = [
              + "sg-0db9e6c20711ab0bd",
            ]
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Environment" = "dev"
              + "Managed_by"  = "terraform"
              + "Name"        = "dev-app-template-instance"
              + "Project"     = "dev-project"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Environment" = "dev"
              + "Managed_by"  = "terraform"
              + "Name"        = "dev-app-template-volume"
              + "Project"     = "dev-project"
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + asg_details             = {
      + arn  = (known after apply)
      + id   = (known after apply)
      + name = "test-asg"
    }
  + launch_template_details = {
      + id             = (known after apply)
      + latest_version = (known after apply)
      + name           = "dev-app-template"
    }

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @abhijeetpoonia, Action: `pull_request`*